clojure/bob/index.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-03-04 Fri 23:27 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>Exercism.io → Clojure → Bob</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Eric Bailey">
<meta  name="description" content="My solutions to Excercism.io in Clojure."
>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/css/bootstrap.min.css">
<link rel="stylesheet" type="text/css" href="../../css/style.min.css">


</head>
<body>
<div id="content">
<h1 class="title">Exercism.io → Clojure → Bob</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">Bob</a>
<ul>
<li><a href="#orgheadline2">Source</a></li>
<li><a href="#orgheadline3">Solution</a>
<ul>
<li><a href="#orgheadline4"><code>cond</code></a></li>
<li><a href="#orgheadline5">Did you even say anything?</a></li>
<li><a href="#orgheadline6">ARE YOU YELLING‽</a></li>
<li><a href="#orgheadline7">What's that?</a></li>
<li><a href="#orgheadline8">Whatever</a></li>
<li><a href="#orgheadline9">All together now</a></li>
</ul>
</li>
<li><a href="#orgheadline10">Tests</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Bob</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
Bob is a lackadaisical teenager. In conversation, his responses are very
limited.
</p>

<p>
Bob answers 'Sure.' if you ask him a question.
</p>

<p>
He answers 'Whoa, chill out!' if you yell at him.
</p>

<p>
He says 'Fine. Be that way!' if you address him without actually saying
anything.
</p>

<p>
He answers 'Whatever.' to anything else.
</p>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">Source</h3>
<div class="outline-text-3" id="text-orgheadline2">
<p>
Inspired by the <a href="http://pine.fm/LearnToProgram/?Chapter=06">'Deaf Grandma'</a> exercise in Chris Pine's Learn to Program
tutorial.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">Solution</h3>
<div class="outline-text-3" id="text-orgheadline3">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">ns</span> <span style="color: #66D9EF;">bob</span>
  <span style="color: #75715E;">"Mimicking the conversational ineptitude of a lackadaisical teenager."</span>
  <span style="color: #66D9EF;">{</span><span style="color: #AE81FF;">:author</span> <span style="color: #E6DB74;">"Eric Bailey"</span><span style="color: #66D9EF;">}</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Given a prompt, <code>response-for</code> returns Bob's lackadaisical response.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defn</span> <span style="color: #A6E22E;">response-for</span> <span style="color: #66D9EF;">[</span>prompt<span style="color: #66D9EF;">]</span> ...<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><code>cond</code></h4>
<div class="outline-text-4" id="text-orgheadline4">
<p>
TODO: discuss <code>cond</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5">Did you even say anything?</h4>
<div class="outline-text-4" id="text-orgheadline5">
<p>
According to the specification, if you don't even say anything to Bob, the
response should be <code>Fine. Be that way!</code>
</p>

<p>
To check if <code>prompt</code> consists entirely of whitespace, we can use <a href="http://clojuredocs.org/clojure.core/re-matches"><code>re-matches</code></a>
with the regular expression <code>^\s*$</code>, i.e. match if it starts with zero or more
whitespace characters and then ends, with nothing else between.
</p>

<div class="org-src-container">

<pre class="src src-clojure" id="orgsrcblock1"><span style="color: #AE81FF;">(</span>re-matches #<span style="color: #E6DB74;">"^\s*$"</span> prompt<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6">ARE YOU YELLING‽</h4>
<div class="outline-text-4" id="text-orgheadline6">
<p>
If the prompt is yelled, Bob should respond with <code>Whoa, chill out!</code>
</p>

<p>
To determine whether <code>prompt</code> is yelled, we first need to check if it contains
at least one uppercase alphabetic character:
</p>

<div class="org-src-container">

<pre class="src src-clojure" id="orgsrcblock2"><span style="color: #AE81FF;">(</span>re-find #<span style="color: #E6DB74;">"[A-Z]"</span> prompt<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
and if so, check if <code>prompt</code> is equal to itself with every character uppercased:
</p>

<div class="org-src-container">

<pre class="src src-clojure" id="orgsrcblock3"><span style="color: #AE81FF;">(</span>= prompt <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">clojure.string</span><span style="color: #F8F8F2; background-color: #272822;">/</span>upper-case prompt<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7">What's that?</h4>
<div class="outline-text-4" id="text-orgheadline7">
<p>
If you ask Bob a question, he invariably answers, <code>Sure.</code> i.e. if <code>prompt</code> ends
with <code>?</code>.
</p>

<p>
The code to check very closely resembles English.
</p>
<div class="org-src-container">

<pre class="src src-clojure" id="orgsrcblock4"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">.endsWith</span> prompt <span style="color: #E6DB74;">"?"</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
We could modify the <a href="http://clojure.org/Java%20Interop-The%20Dot%20special%20form-(.%20instance-expr%20(method-symbol%20args*))%20or">syntax</a> a bit to get even more English-looking:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">.</span> prompt <span style="color: #66D9EF;">(</span><span style="color: #F92672;">endsWith</span> <span style="color: #E6DB74;">"?"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
As a matter of taste, I prefer <a href="#orgsrcblock4">the former</a>.
</p>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8">Whatever</h4>
<div class="outline-text-4" id="text-orgheadline8">
<p>
If none of the tests above hold, Bob responds, <code>Whatever.</code>
</p>

<div class="org-src-container">

<pre class="src src-clojure" id="orgsrcblock5"><span style="color: #AE81FF;">:else</span> <span style="color: #E6DB74;">"Whatever."</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9">All together now</h4>
<div class="outline-text-4" id="text-orgheadline9">
<p>
Finally, we end up with the following definition of <code>response-for</code>:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defn</span> <span style="color: #A6E22E;">response-for</span> <span style="color: #66D9EF;">[</span>prompt<span style="color: #66D9EF;">]</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">cond</span>
    <span style="color: #A6E22E;">(</span>re-matches #<span style="color: #E6DB74;">"^\s*$"</span> prompt<span style="color: #A6E22E;">)</span> <span style="color: #E6DB74;">"Fine. Be that way!"</span>
    <span style="color: #A6E22E;">(</span><span style="color: #F92672;">and</span> <span style="color: #E6DB74;">(</span>re-find #<span style="color: #E6DB74;">"[A-Z]"</span> prompt<span style="color: #E6DB74;">)</span>
         <span style="color: #E6DB74;">(</span>= prompt <span style="color: #FD971F;">(</span><span style="color: #66D9EF;">clojure.string</span><span style="color: #F8F8F2; background-color: #272822;">/</span>upper-case prompt<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span> <span style="color: #E6DB74;">"Whoa, chill out!"</span>
    <span style="color: #A6E22E;">(</span><span style="color: #F92672;">.endsWith</span> prompt <span style="color: #E6DB74;">"?"</span><span style="color: #A6E22E;">)</span> <span style="color: #E6DB74;">"Sure."</span>
    <span style="color: #AE81FF;">:else</span> <span style="color: #E6DB74;">"Whatever."</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10">Tests</h3>
<div class="outline-text-3" id="text-orgheadline10">
<div class="org-src-container">

<pre class="src src-bash">lein test bob
</pre>
</div>
<pre class="example">
Ran 14 tests containing 14 assertions.
0 failures, 0 errors.
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
